[
	{
		"title": "My UI Design Endeavors: BioCom Website Group 2-Week Sprint",
		"description": "A behind-the-scenes look at a fast-paced, collaborative website redesign sprint for BioCom, transforming their online presence in just two weeks.",
		"dateFormatted": "Aug 16th, 2024",
		"link": "/post/ui-biocom"
	},
	{
		"title": "My UI Design Endeavors: The Story Behind the TNAU Botanical Garden Website",
		"description": "Exploring the journey from design to development, focusing on the tech stack choices that made it all possible.",
		"dateFormatted": "Aug 15th, 2024",
		"link": "/post/ui-tnau"
	},
	{
		"title": "Understanding How Websites Load: SSG, CSR, and SSR Explained",
		"description": "Explore the differences between Static Site Generation, Client-Side Rendering, and Server-Side Rendering, and how popular frameworks like React, Angular, Vue, Next.js, Nuxt.js, and Astro fit into these methods.",
		"dateFormatted": "Aug 14th, 2024",
		"link": "/post/ssg-ssr-csr"
	},
	{
		"title": "Difference Between Static and Dynamic Websites",
		"description": "Understand the key differences between static and dynamic websites with simple examples and explanations.",
		"dateFormatted": "Aug 13th, 2024",
		"link": "/post/static-dynamic-website"
	},
	{
		"title": "Single Page Applications vs Multi Page Applications",
		"description": "Explore the differences between Single Page Applications (SPA) and Multi-Page Applications (MPA), and see how popular frontend frameworks like React, Angular, Vue, Next.js, Nuxt.js, and Astro fit into these architectures.",
		"dateFormatted": "Aug 12th, 2024",
		"link": "/post/spa-mpa"
	},
	{
		"title": "Understanding the DOM: How HTML, CSS, and JavaScript Work Together",
		"description": "Learn how the Document Object Model (DOM) acts as a bridge between HTML, CSS, and JavaScript, turning web pages into interactive experiences with easy-to-understand examples.",
		"dateFormatted": "Aug 11th, 2024",
		"link": "/post/dom"
	},
	{
		"title": "Unlocking Website Quality with Unlighthouse",
		"description": "Discover how Unlighthouse simplifies website evaluations using Google Lighthouse, offering a faster and more user-friendly approach to improving site quality across performance, accessibility, best practices, and SEO.",
		"dateFormatted": "Aug 10th, 2024",
		"link": "/post/unlighthouse"
	},
	{
		"title": "Maximizing Your Website's Efficiency: A Guide to Key Performance Metrics",
		"description": "Learn how to enhance your website's overall performance by understanding and optimizing critical metrics like page speed, responsiveness, stability, and resource usage.",
		"dateFormatted": "Aug 9th, 2024",
		"link": "/post/website-performance"
	},
	{
		"title": "Choosing Between Traditional and Headless CMS - What You Need to Know",
		"description": "Explore the key differences between traditional and headless CMS in our guide. Learn how modern headless solutions, like Git-based and API-first options, can streamline digital content management and enhance your strategy.",
		"dateFormatted": "Aug 8th, 2024",
		"link": "/post/cms"
	}
]
